cracking-the-coding-interview/3.3.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Cracking the Coding Interviews-Q3.3</title>
<!-- 2014-12-02 二 11:18 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="马楠（nxmanan#gmail.com）" />
<meta  name="description" content="Cracking the Coding Interview笔记"
 />
<meta  name="keywords" content="Algorithm" />
<link rel="stylesheet" type="text/css" href="../style/emacs.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./interview-questions.html"> UP </a>
 |
 <a accesskey="H" href="http://wiki.manan.org"> HOME </a>
</div><div id="content">
<h1 class="title">Cracking the Coding Interviews-Q3.3</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">题目</a>
<ul>
<li><a href="#sec-1-1">原文</a></li>
<li><a href="#sec-1-2">译文</a></li>
</ul>
</li>
<li><a href="#sec-2">解答</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">题目</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">原文</h3>
<div class="outline-text-3" id="text-1-1">
<blockquote>
<p>
Imagine a (literal) stack of plates. If the stack gets too high, it might topple. Therefore, in real life, we would likely start a new stack when the previous stack exceeds some threshold. Implement a data structure SetOfStacks that mimics this. SetOfStacks should be composed of several stacks and should create a new stack once the previous one exceeds capacity. SetOfStacks.push() and SetOfStacks.pop() should behave identically to a single stack (that is, pop() should return the same values as it would if there were just a single stack). FOLLOW UP:Implement a function popAt(int index) which performs a pop operation on a specific sub-stack.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">译文</h3>
<div class="outline-text-3" id="text-1-2">
<blockquote>
<p>
设想有一摞盘子，当盘子堆的太高时可能会掉落。所以在现实中，当前一摞盘子堆的太高时，我们会开始新的一摞。实现一个叫 SetOfStacks 的数据结构来模拟这种情况。 SetOfStacks 由若干个栈构成，当前一个栈容量超限时会新建一个新的栈。 SetOfStacks.push() 和 SetOfStacks.pop() 和一般栈的行为应一致。
</p>

<p>
扩展问题：
</p>

<p>
实现一个函数popAt(int index)，使它能在指定的子栈上执行pop操作。
</p>
</blockquote>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">解答</h2>
<div class="outline-text-2" id="text-2">
<p>
用list保存所有子栈即可，每当一个栈满时，增加新栈。
</p>

<p>
扩展问题需要了解是否要保持各栈容量为满，如果需要则要进行栈元素移动操作。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2014-12-01</p>
<p class="author">Author: 马楠（nxmanan#gmail.com）</p>
<p class="date">Created: 2014-12-02 二 11:18</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 23.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.7b)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
